Service - AIM/archive/v1/sample messages/body-aim-returnfile-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <add:Action xmlns:add="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/File</add:Action>
    </soap:Header>
    <soap:Body>
        <ret:File xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnFileRequestMsg>
                <fil:FileRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
                    <ret1:fileRequest xmlns:ret1="urn:www.ird.govt.nz/GWS:types/ReturnAIM.v1">
                        <ret2:fileHeader xmlns:ret2="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v1">
                            <com:softwareProviderData xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1">
                                <com:softwareProvider>SoftwareProvider</com:softwareProvider>
                                <com:softwarePlatform>SoftwarePlatform</com:softwarePlatform>
                                <com:softwareRelease>v1</com:softwareRelease>
                            </com:softwareProviderData>
                            <com:identifier xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1" IdentifierValueType="ACCIRD">123081420</com:identifier>
                            <com:accountType xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1">INC</com:accountType>
                            <ret2:periodEndDate>2018-09-30</ret2:periodEndDate>
                            <ret2:majorFormType>SOA</ret2:majorFormType>
                        </ret2:fileHeader>
                        <ret2:fileBody xmlns:ret2="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v1">
                            <ret2:standardFields>
                                <ret2:isNilReturn>false</ret2:isNilReturn>
                                <ret2:amendmentRequest>
                                    <ret2:isAmended>false</ret2:isAmended>
                                    <ret2:amendReason/>
                                    <ret2:amendDetails/>
                                </ret2:amendmentRequest>
                            </ret2:standardFields>
                            <ret2:formFields xsi:type="ret1:FormFieldsType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                                <ret1:aimInstalmentDate>2018-10-29</ret1:aimInstalmentDate>
                                <ret1:grossSalesAndServiceIncome>1000.00</ret1:grossSalesAndServiceIncome>
                                <ret1:openingStock>1002.00</ret1:openingStock>
                                <ret1:purchases>1003.00</ret1:purchases>
                                <ret1:closingStock userAdjustedValue="100.00" systemAdjustedValue="100.00">100.00</ret1:closingStock>
                                <ret1:grossProfit>1006.00</ret1:grossProfit>
                                <ret1:interestReceived>1007.00</ret1:interestReceived>
                                <ret1:dividendsReceived>1008.00</ret1:dividendsReceived>
                                <ret1:rentLeaseLicenceIncome>1009.00</ret1:rentLeaseLicenceIncome>
                                <ret1:otherIncome>1010.00</ret1:otherIncome>
                                <ret1:badDebts>1011.00</ret1:badDebts>
                                <ret1:depreciationAndAmortisation>1012.00</ret1:depreciationAndAmortisation>
                                <ret1:insurance>1013.00</ret1:insurance>
                                <ret1:interestExpense>1014.00</ret1:interestExpense>
                                <ret1:fees>1015.00</ret1:fees>
                                <ret1:rates>1016.00</ret1:rates>
                                <ret1:rentsLeasesLicences>1017.00</ret1:rentsLeasesLicences>
                                <ret1:repairsAndMaintenance>1018.00</ret1:repairsAndMaintenance>
                                <ret1:researchAndDevelopment>1019.00</ret1:researchAndDevelopment>
                                <ret1:relatedPartyRemuneration>1020.00</ret1:relatedPartyRemuneration>
                                <ret1:salariesAndWages>1021.00</ret1:salariesAndWages>
                                <ret1:contractorPayments>1022.00</ret1:contractorPayments>
                                <ret1:otherExpenses>1023.00</ret1:otherExpenses>
                                <ret1:exceptionalItems>1024.00</ret1:exceptionalItems>
                                <ret1:netProfitLossBeforeTax>1024.50</ret1:netProfitLossBeforeTax>
                                <ret1:taxAdjustments>1025.00</ret1:taxAdjustments>
                                <ret1:currentYearTaxableProfitLoss>1024.50</ret1:currentYearTaxableProfitLoss>
                                <ret1:accountsReceivable userAdjustedValue="100.00" systemAdjustedValue="100.00">100.00</ret1:accountsReceivable>
                                <ret1:cashAndDeposits>1028.00</ret1:cashAndDeposits>
                                <ret1:otherCurrentAssets>1029.00</ret1:otherCurrentAssets>
                                <ret1:vehicles>1030.00</ret1:vehicles>
                                <ret1:plantAndMachinery>1031.00</ret1:plantAndMachinery>
                                <ret1:furnitureAndFittings>1032.00</ret1:furnitureAndFittings>
                                <ret1:land>1033.00</ret1:land>
                                <ret1:buildings>1034.00</ret1:buildings>
                                <ret1:otherFixedAssets>1035.00</ret1:otherFixedAssets>
                                <ret1:intangibles>1036.00</ret1:intangibles>
                                <ret1:sharesAndOwnershipInterests>1037.00</ret1:sharesAndOwnershipInterests>
                                <ret1:termDeposits>1038.00</ret1:termDeposits>
                                <ret1:otherNonCurrent>1039.00</ret1:otherNonCurrent>
                                <ret1:provisions userAdjustedValue="100.00" systemAdjustedValue="1040.00">1041.00</ret1:provisions>
                                <ret1:provisionsForShareholderSalaries userAdjustedValue="100.00" systemAdjustedValue="1042.00">1043.00</ret1:provisionsForShareholderSalaries>
                                <ret1:accountsPayable userAdjustedValue="100.00" systemAdjustedValue="1044.00">1045.00</ret1:accountsPayable>
                                <ret1:currentLoans>1046.00</ret1:currentLoans>
                                <ret1:otherCurrentLiabilities>1047.00</ret1:otherCurrentLiabilities>
                                <ret1:nonCurrentLiabilities>1048.00</ret1:nonCurrentLiabilities>
                                <ret1:ownersEquity>1049.00</ret1:ownersEquity>
                                <ret1:taxDepreciation userAdjustedValue="100.00" systemAdjustedValue="1050.00">1051.00</ret1:taxDepreciation>
                                <ret1:unTaxedRealisedGainsAndReceipts>1052.00</ret1:unTaxedRealisedGainsAndReceipts>
                                <ret1:additionsToFixedAssets>1053.00</ret1:additionsToFixedAssets>
                                <ret1:disposalOfFixedAssets>1054.00</ret1:disposalOfFixedAssets>
                                <ret1:depreciationRecovered userAdjustedValue="100.00" systemAdjustedValue="1055.00">1056.00</ret1:depreciationRecovered>
                                <ret1:losses>1056.00</ret1:losses>
                                <ret1:privateUse userAdjustedValue="100.00" systemAdjustedValue="1059.00">1060.00</ret1:privateUse>
                                <ret1:dividendsPaid>1061.00</ret1:dividendsPaid>
                                <ret1:drawings>1062.00</ret1:drawings>
                                <ret1:currentAccountYearEndBalances>1063.00</ret1:currentAccountYearEndBalances>
                                <ret1:taxDeductibleLossOnDisposalOfFixedAssets>1064.00</ret1:taxDeductibleLossOnDisposalOfFixedAssets>
                                <ret1:otherAdjustments>
                                    <ret1:adjustments>
                                        <ret1:amount>1065.00</ret1:amount>
                                        <ret1:description>test</ret1:description>
                                    </ret1:adjustments>
                                </ret1:otherAdjustments>
                                <ret1:yearToDateProvTaxLiability>1068.00</ret1:yearToDateProvTaxLiability>
                                <ret1:thisInstalment>1069.00</ret1:thisInstalment>
                                <ret1:shareholderProvTax>1070.00</ret1:shareholderProvTax>
                                <ret1:refundAmount>750.00</ret1:refundAmount>
                                <ret1:refundIndicator>true</ret1:refundIndicator>
                            </ret2:formFields>
                        </ret2:fileBody>
                    </ret1:fileRequest>
                </fil:FileRequestWrapper>
            </ret:ReturnFileRequestMsg>
        </ret:File>
    </soap:Body>
</soap:Envelope>